package org.example.GB_Java;
import java.util.Scanner;

/** 3) Дана json-строка (можно сохранить в файл и читать из файла)
 [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},{"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
 Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
 Пример вывода:
 Студент Иванов получил 5 по предмету Математика.
 Студент Петрова получил 4 по предмету Информатика.
 Студент Краснов получил 5 по предмету Физика.
 */

public class ThirdTask {

        static void rebuildJson() {
            String json = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"},{\"фамилия\":\"Петрова\"," +
                    "\"оценка\":\"4\",\"предмет\":\"Информатика\"},{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";

            String[] jsonArray = json.split("},\\{");       //разбиваем исходник на 3 самостоятельных выражения через "},{"

            for (int i = 0; i < jsonArray.length; i++) {            // удаляем лишние символы из выражений
                jsonArray[i] = jsonArray[i].replaceAll("[^а-яА-Я0-9]+", " ");
                jsonArray[i] = jsonArray[i].trim();
            }

            StringBuilder sb = new StringBuilder();
            String output = "";

            String[] substring = new String[6];                     //подстрока для разбивки выражений на слова

            for (int i = 0; i < jsonArray.length; i++) {
                sb.setLength(0);
                substring = jsonArray[i].split(" ");
                sb.append("Студент " + substring[1] + " получил " + substring[3] + " по предмету " + substring[5]);
                System.out.println(output = sb.toString());
            }
        }
}
